|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd

In [27]:
#df = pd.read_csv(r"https://github.com/leangaurav/dsc_weekday_2020_08_13/raw/master/CODE/titanic_dataset.csv")
#df = pd.read_csv(r"/home/leangaurav/training/workspace/dsc_weekday_2020_08_13/CODE/titanic_dataset.csv")
df = pd.read_csv(r"../Assignments/titanic_dataset.csv", index_col=0)
print(df)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

      gender      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  $211.34        B5        S    2
1       male   0.9167      1      2  113781  $151.55   C22 C26        S   11
2     female   2.0000      1      2  113781  $151.55   C22 C26        S  NaN
3       male  30.0000      1      2  113781  $151.55   C22 C26        S  NaN
4     female  25.0000      1      2  113781  $151.55   C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   $14.45       NaN        C  NaN
1305  female      NaN      1      0    2665   $14.45       NaN        C  NaN
1306    male  26.5000      0      0    2656    $7.23       NaN        C  NaN
1307    male  27.0000      0      0    2670    $7.23       NaN        C  NaN
1308    male  29.0000      0      0  315082    $7.88       NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [12]:
import os
r = os.walk('.')
print(r)

for t in r:
    print(t)

<generator object walk at 0x7ff3e2056d60>
('.', ['scripts', '.ipynb_checkpoints', 'modules', 'files'], ['S112_08_28_dict.ipynb', 'temp.csv', 'S101_08_27_FormatSrings_Exceptions_CmdArgs.ipynb', 'S071_08_24_list.ipynb', 'test.py', 'S050_08_19_functions.ipynb', 'Untitled.ipynb', 'S072_08_24_while_loop.ipynb', 'S141_09_03_timeit.ipynb', 'S031_08_17_operators.ipynb', 'S041_08_18_import_random.ipynb', 'S061_08_20_list.ipynb', 'S032_08_17_input_type_conversion.ipynb', 'f1_timeit.py', 'S161_09_07_regex_file_handling_question-Copy1.ipynb', 'AssignmentTitanic1Pandas.ipynb', 'S151_09_04_regex_file_handling_question.ipynb', 'S171_09_08_Numpy2.ipynb', 'S092_08_26_functions.ipynb', 'S172_09_08_Pandas_1.ipynb', 'titanic_dataset.csv', 'S010_08_13_Intro.ipynb', 'S161_09_07_numpy.ipynb', 'S040_08_18_string_slicing_indexing.ipynb', 'S091_08_26.ipynb', 'S181_09_09_Pandas1.ipynb', 'S020_08_14_Tokens.ipynb', 'S050_08_19_strings.ipynb', 'S131_09_02_dictionary.ipynb', 'S111_08_28_HigherOrderFunctions_Lambda_VarLenArgs.ipynb', 'S081_08_25_for_break_continue.ipynb', 'S060_08_20_If_else.ipynb'])
('./scripts', ['exceptions', 'cmdlineargs', 'functions'], [])
('./scripts/exceptions', [], ['f4_exception_data.py', 'f8_finally.py', 'f7_exit.py', 'f1.py', 'f6_error_propagation.py', 'f5_exception_hierarchy.py', 'f9_raise_custom.py', 'f3_multi_handlers.py', 'f2.py'])
('./scripts/cmdlineargs', [], ['f1.py', 'f2.py'])
('./scripts/functions', [], ['f1.py', 'f2_doc_string.py', 'New Text Document.txt'])
('./.ipynb_checkpoints', [], ['S172_09_08_Pandas_1-checkpoint.ipynb', 'S161_09_07_regex_file_handling_question-Copy1-checkpoint.ipynb', 'S171_09_08_Numpy2-checkpoint.ipynb', 'S161_09_07_numpy-checkpoint.ipynb', 'AssignmentTitanic1Pandas-checkpoint.ipynb', 'S181_09_09_Pandas1-checkpoint.ipynb'])
('./modules', ['__pycache__'], ['f1.py', 'f2.py'])
('./modules/__pycache__', [], ['f2.cpython-37.pyc'])
('./files', [], ['temp2.txt', 'f2_print_numbers.py', 'f10_copy.py', 'f1.py', 'f7.append.py', 'f11_cat.py', 'f6_read_n.py', 'f9_read_binary.py', 'f3_auto_close.py', 'temp.txt', 'f5_read.py', 'temp1.txt', 'temp3.txt', 'f8_read_lines.py', 'f12_copy.py', 'f4_write.py', 'f1_copy.py', 'lines.txt'])

In [8]:
print(df.head())

   Unnamed: 0  pclass  survived  \
0           0       1         1
1           1       1         1
2           2       1         0
3           3       1         0
4           4       1         0

                                              name  gender      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton  female  29.0000      0
1                   Allison, Master. Hudson Trevor    male   0.9167      1
2                     Allison, Miss. Helen Loraine  female   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  $211.34        B5        S    2    NaN
1      2  113781  $151.55   C22 C26        S   11    NaN
2      2  113781  $151.55   C22 C26        S  NaN    NaN
3      2  113781  $151.55   C22 C26        S  NaN  135.0
4      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [19]:
df

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,$14.45,NaN,C,NaN,328.0,NaN
1305,1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,$14.45,NaN,C,NaN,NaN,NaN
1306,1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,$7.23,NaN,C,NaN,304.0,NaN
1307,1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,$7.23,NaN,C,NaN,NaN,NaN
1308,1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,$7.88,NaN,S,NaN,NaN,NaN

In [20]:
df.isna().sum()

Unnamed: 0       0
pclass           0
survived         0
name             0
gender           0
age            263
sibsp            0
parch            0
ticket           0
fare             1
cabin         1014
embarked         2
boat           823
body          1188
home.dest      564
dtype: int64

In [22]:
df.isna().any()

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [24]:
df.columns[df.isna().any()]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [ ]:
,2,3
3,4,5
3,,5

In [ ]:
df.dropna()
df.is

In [32]:
pd.__version__

'1.0.5'

In [33]:
import os
os.sys.path

['/home/leangaurav/training/workspace/dsc_weekday_2020_08_13/CODE',
 '/opt/anaconda3/lib/python38.zip',
 '/opt/anaconda3/lib/python3.8',
 '/opt/anaconda3/lib/python3.8/lib-dynload',
 '',
 '/home/leangaurav/.local/lib/python3.8/site-packages',
 '/opt/anaconda3/lib/python3.8/site-packages',
 '/opt/anaconda3/lib/python3.8/site-packages/IPython/extensions',
 '/home/leangaurav/.ipython']

In [37]:
df.groupby(['pclass','gender']).age.min()
df.groupby(['pclass','gender']).age.max()

pclass  gender
1       female    76.0
        male      80.0
2       female    60.0
        male      70.0
3       female    63.0
        male      74.0
Name: age, dtype: float64

In [39]:
print(df.groupby(['pclass','gender']).age.size())
print(df.groupby(['pclass','gender']).age.count())

pclass  gender
1       female    144
        male      179
2       female    106
        male      171
3       female    216
        male      493
Name: age, dtype: int64
pclass  gender
1       female    133
        male      151
2       female    103
        male      158
3       female    152
        male      349
Name: age, dtype: int64

In [40]:
df.isna().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [44]:
r = df.embarked.dropna()
print(r.shape)
res = df.iloc[r.index]
print(res.shape)

(1307,)

KeyError: "None of [Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,\n            ...\n            1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308],\n           dtype='int64', length=1307)] are in the [columns]"

In [45]:
df.embarked.dropna(axis=0,inplace=True)
print(df.shape)

(1309, 14)

In [46]:
df.dropna(subset=['embarked'],how='any',inplace=True)
print(df.shape)

(1307, 14)

In [ ]:
df.age.fillna(value=df.age.mean(),inplace=True)
df.fare.fillna(value=df.fare.mean(),inplace=True)

In [47]:
df.isna().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        0
boat          823
body         1186
home.dest     563
dtype: int64

In [55]:
r = df.fillna("10abc")

In [56]:
r.isna().sum()

pclass       0
survived     0
name         0
gender       0
age          0
sibsp        0
parch        0
ticket       0
fare         0
cabin        0
embarked     0
boat         0
body         0
home.dest    0
dtype: int64

In [57]:
print(df.tail())
print(r.tail())

      pclass  survived                       name  gender   age  sibsp  parch  \
1304       3         0       Zabour, Miss. Hileni  female  14.5      1      0
1305       3         0      Zabour, Miss. Thamine  female   NaN      1      0
1306       3         0  Zakarian, Mr. Mapriededer    male  26.5      0      0
1307       3         0        Zakarian, Mr. Ortin    male  27.0      0      0
1308       3         0         Zimmerman, Mr. Leo    male  29.0      0      0

      ticket     fare cabin embarked boat   body home.dest
1304    2665  $14.45    NaN        C  NaN  328.0       NaN
1305    2665  $14.45    NaN        C  NaN    NaN       NaN
1306    2656   $7.23    NaN        C  NaN  304.0       NaN
1307    2670   $7.23    NaN        C  NaN    NaN       NaN
1308  315082   $7.88    NaN        S  NaN    NaN       NaN
      pclass  survived                       name  gender    age  sibsp  \
1304       3         0       Zabour, Miss. Hileni  female   14.5      1
1305       3         0      Zabour, Miss. Thamine  female  10abc      1
1306       3         0  Zakarian, Mr. Mapriededer    male   26.5      0
1307       3         0        Zakarian, Mr. Ortin    male     27      0
1308       3         0         Zimmerman, Mr. Leo    male     29      0

      parch  ticket     fare  cabin embarked   boat   body home.dest
1304      0    2665  $14.45   10abc        C  10abc    328     10abc
1305      0    2665  $14.45   10abc        C  10abc  10abc     10abc
1306      0    2656   $7.23   10abc        C  10abc    304     10abc
1307      0    2670   $7.23   10abc        C  10abc  10abc     10abc
1308      0  315082   $7.88   10abc        S  10abc  10abc     10abc

In [58]:
df.dtypes

pclass         int64
survived       int64
name          object
gender        object
age          float64
sibsp          int64
parch          int64
ticket        object
fare          object
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [59]:
r.dtypes

pclass        int64
survived      int64
name         object
gender       object
age          object
sibsp         int64
parch         int64
ticket       object
fare         object
cabin        object
embarked     object
boat         object
body         object
home.dest    object
dtype: object

In [76]:
df.dropna(axis=0, thresh=10).shape

(1151, 14)

In [72]:
df.shape

(1307, 14)

In [70]:
print(df.head())

   pclass  survived                                             name  gender  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000      0      0   24160  $211.34        B5        S    2    NaN
1   0.9167      1      2  113781  $151.55   C22 C26        S   11    NaN
2   2.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN
3  30.0000      1      2  113781  $151.55   C22 C26        S  NaN  135.0
4  25.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [66]:
df.shape

(1307, 14)

In [71]:
r.shape

(1307, 14)